{
    "title": "SpikeGen Blender Add-on",
    "slug": "blender-spikegen",
    "type": "programming",
    "tags": "computer graphics",
    "thumbnail": {
        "src": "/media/spikegen-small.webp",
        "alt": "Blender render of a cylinder, cone, sphere, and cube with cactus-like spines"
    },
    "date": "2020",
    "dateLong": "Fall 2020",
    "description": "",
    "descriptionLong": [
        "Developed “SpikeGen,” a Blender add-on for procedural spike generation on a mesh. With controls for length, base size, divergence angle, spread distance, and jitter, SpikeGen can emulate [phyllotactic spirals](https://en.wikipedia.org/wiki/Phyllotaxis) found in plant leaves and arrangements of spines and glochids on cacti.",
        "SpikeGen was inspired by the SIGGRAPH 1992 paper [*A collision-based model of spiral phyllotaxis*](https://dl.acm.org/doi/10.1145/142920.134093).",
        "Shown are four close-up renders from a looping indoor animation that I modeled, textured, lit, and rendered in Blender. SpikeGen was used to add spines to my partner’s procedural cactus bodies, who also procedurally generated the clay pots. I also used procedural techniques to create the fire and snow particle systems.",
        "Final project for CPSC 479 at Yale, *Advanced Topics in Computer Graphics*.",
        "[Link to writeup](https://docs.google.com/document/d/1x77p6YtkmbgTR6E4v7X_IVnZ6aW7NpognrPyQsuuHsU/edit?usp=sharing)"
    ],
    "main": [
        {
            "class": "image-grid-small centered-2",
            "contents": [
                {
                    "src": "/media/spikegen/spikegen_menu.jpeg",
                    "alt": "Screenshot of a Blender menu for the SpikeGen add-on. The menu says 'SpikeGen Generator'.",
                    "caption": "SpikeGen menu"
                },
                {
                    "src": "/media/spikegen/spikegen_2.jpeg",
                    "alt": "Computer generated image of a sphere dotted with spikes in a pattern similar to spiral patterns found in nature.",
                    "caption": "The default divergence angle is the golden ratio"
                },
                {
                    "src": "/media/spikegen/spikegen_1.jpeg",
                    "alt": "Computer generated image of four Blender primitives, a cylinder, a cone, a sphere, and a cube. They are arranged in a 2 by 2 grid and are covered with white spikes.",
                    "caption": "SpikeGen applied to a variety of meshes"
                }
            ]
        },
        {
            "contents": ["<br><br>"]
        },
        {
            "class": "centered",
            "contents": ["Additional close-up renders."]
        },
        {
            "class": "media-grid-2 centered",
            "contents": [
                {
                    "src": "/media/spikegen/cozy_3.jpeg",
                    "alt": "Computer generated image of three cactus plants on a windowsill."
                },
                {
                    "src": "/media/spikegen/cozy_4.jpeg",
                    "alt": "Computer generated image of the top half of a stone fireplace, a wooden mantel with three light blue cups, and a picture frame with a landscape painting."
                },
                {
                    "src": "/media/spikegen/cozy_5.jpeg",
                    "alt": "Computer generated image of a close-up of a stone fireplace. Three logs sit atop a holder and a bright orange frame fills the chamber."
                },
                {
                    "src": "/media/spikegen/cozy_6.jpeg",
                    "alt": "Computer generated image of a close=up of a window frame. Outside the ground is blanketed with snow and snowflakes are seen falling."
                }
            ]
        }
    ]
}
